Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.Normal
The vertex's normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.Position
The vertex's position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructs the vertex from a point and a normal vector.
position:
The vertex's position.
normal:
The vertex's normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017